In [3]:
import pandas as pd 
import numpy as np

In [4]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [5]:
frame = pd.read_csv("data/ex1.csv")

In [6]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
frame.to_pickle("data/frame_pickel")

In [8]:
pd.read_pickle("data/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
!pip install openpyxl xlrd

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 2.2 MB/s eta 0:00:00a 0:00:01m
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 96.5/96.5 kB 8.1 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: xlrd, et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2 xlrd-2.0.1

In [12]:
xlsx = pd.ExcelFile("data/ex1.xlsx")

In [13]:
xlsx.sheet_names

['Sheet1']

In [14]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [15]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
frame = pd.read_excel("data/ex1.xlsx", sheet_name="Sheet1")

In [17]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [18]:
writer = pd.ExcelWriter("data/ex2.xlsx")

In [19]:
frame.to_excel(writer, "Sheet1")

In [20]:
writer.save()

In [21]:
frame.to_excel("data/ex2.xlsx")

In [22]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [24]:
store["obj1"]

UsageError: Unknown variable '[obj1]'

In [25]:
!pip install requests

Requirement already satisfied: requests in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.28.2)
Requirement already satisfied: charset-normalizer<4,>=2 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from requests) (3.1.0)
Requirement already satisfied: idna<4,>=2.5 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from requests) (3.4)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from requests) (1.26.14)
Requirement already satisfied: certifi>=2017.4.17 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from requests) (2022.12.7)

In [26]:
import requests

In [27]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [28]:
resp = requests.get(url)

In [29]:
resp.raise_for_status()

In [30]:
resp

In [31]:
data = resp.json()

In [32]:
data[0]["title"]

'CLN: More numpy 2 stuff'

In [33]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [34]:
issues

,number,title,labels,state
0,57668,CLN: More numpy 2 stuff,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open
1,57666,BUG: pyarrow stripping leading zeros with dtyp...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,57665,BUG: interchange protocol with nullable dataty...,"[{'id': 4344388253, 'node_id': 'LA_kwDOAA0YD88...",open
3,57664,BUG: interchange protocol with nullable pyarro...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,57663,BUG: melt no longer supports id_vars and value...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
5,57662,Reader accept directory path with suffix check,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
6,57661,BUG: Transform() function returns unexpected r...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,57660,BUG: to_sql fails for Oracle BLOB columns,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,57659,ENH: DataFrame.duplicated() should have defaul...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
9,57657,Fixing bug_ 57596,[],open
10,57656,BUG: groupby.apply respects as_index=False if ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,57651,PERF: Return RangeIndex from RangeIndex.join w...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
12,57648,DOC: Add clarification to groupby docs regardi...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
13,57647,PERF: Return RangeIndex from RangeIndex.reinde...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
14,57646,BUG: Change output returned by _LocIndexer._co...,[],open
15,57645,BUG: Cannot use numpy FLS as indicies since pa...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,57644,BUG: differing syntax for datetime column dtyp...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
17,57643,BUG: interchange protocol with nullable dataty...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,57642,QST: Grouping at fixed time intervals (hours a...,"[{'id': 34444536, 'node_id': 'MDU6TGFiZWwzNDQ0...",open
19,57637,BUG: Fix dataframe.update not updating dtype #...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
20,57636,BUG: .str.replace repl string incorrectly pars...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,57635,BUG: Ensure dataframe preserves categorical in...,[],open
22,57634,Support structural subtyping with ExtensionArray,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
23,57633,ENH: Make ExtensionArray a Protocol,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
24,57632,Compile take functions for uint dtypes,"[{'id': 49094459, 'node_id': 'MDU6TGFiZWw0OTA5...",open
25,57629,second approach to fix setitem parametrizations,[],open
26,57627,"DEPR: remove deprecated units ‘H’, ’T’, and sm...","[{'id': 49597148, 'node_id': 'MDU6TGFiZWw0OTU5...",open
27,57620,Potential regression induced by PR #57302,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
28,57617,ENH: `(Styler|DataFrame).to_typst()`,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,57608,BUG: queries on categorical string columns in ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

In [35]:
import sqlite3

In [36]:
query = """
       .....: CREATE TABLE test
       .....: (a VARCHAR(20), b VARCHAR(20),
       .....:  c REAL,        d INTEGER
       .....: );"""

In [38]:
con = sqlite3.connect("mydata.sqlite")

In [39]:
con.execute(query)

In [40]:
con.commit()

In [43]:
data = [("Atlanta", "Georgia", 1.25, 6),
       ("Tallahassee", "Florida", 2.6, 3),
       ("Sacramento", "California", 1.7, 5)]

In [44]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [45]:
con.executemany(stmt, data)

In [46]:
con.commit()

In [47]:
cursor = con.execute("SELECT * FROM test")

In [48]:
rows = cursor.fetchall()

In [49]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [50]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [52]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [53]:
!pip install sqlalchemy as sqla

Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.0.16)
ERROR: Could not find a version that satisfies the requirement as (from versions: none)
ERROR: No matching distribution found for as

In [54]:
import sqlalchemy as sqla

In [55]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [56]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [57]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [58]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [59]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [60]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [61]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [62]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [63]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [64]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [65]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64